tap "homebrew/bundle"
tap "oven-sh/bun"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go Language's command-line interface for database migrations
brew "goose"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Simple terminal UI for git commands
brew "libheif"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Wraps rm to prevent dangerous deletion of files
brew "safe-rm"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
brew "sqlite"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"

# Virtual workspace manager
cask "flashspace"
cask "font-jetbrains-mono-nerd-font"
