tap "homebrew/bundle"
brew "bat"
brew "cmake"
brew "curl"
brew "docker"
brew "fd"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "go"
brew "goose"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jump"
brew "jpeg"
brew "jq"
brew "llvm"
brew "luajit"
brew "neovim"
brew "pnpm"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "safe-rm"
brew "sqlite"
brew "starship"
brew "tldr"
brew "tmux"
brew "tree-sitter"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-you-should-use"
brew "zsh-vi-mode"

tap "homebrew/cask-fonts"
brew "font-jetbrains-mono-nerd-font"
